
ID = { # this is the global ID for all the characters maybe deprecated
    0: '.',
    1: 'T',
    2: 'R',
    3: 'P',
    4: '█',
    5: '?',
    20: 'T'
}
PLR = { # Player direction
    'up': '▲',
    'down': '▼',
    'left': '◄',
    'right': '►'
}

ENT = { # npcs
    1: 'ꟁ',
    2: 'ṏ',
    3: 'ꝋ',
    4: 'ṍ',
    5: 'ṑ',
    6: 'ṓ',
}
ITM = { # items maybe ? really only using 4 
    1: '◊',
    2: '◌',
    3: '○',
    4: '●',
    5: '⌂',
    6: '҈',
    7: '҉',
    8: 'Ѻ',
    9: 'Ѻ',
    10: '۩',
    11: '۝',
    12: '۞',
    13: '֍',
    14: '֎',
}
WALL = { # walls get verieties too
    1: '☰',
    2: '☱',
    3: '☲',
    4: '☳',
    5: '☴',
    6: '☵',
    7: '☶',
    8: '☷',
}
OBJ = {
    1: 'T',
    2: 'R',
    3: 'P',
    4: WALL[1],
}

FG = {
    'white': 1,
    'black': 2,
    'green': 3,
    'blue': 4,
    'red': 5,
    'yellow': 6,
    'cyan': 7,
    'magenta': 8,
}
BG = {
    'white': 10,
    'black': 20,
    'green': 30,
    'blue': 40,
    'red': 50,
    'yellow': 60,
    'cyan': 70,
    'magenta': 80,
}











# ID = {
#     'tbu': f'֍֎۩۝۞ѺѺ҈҉⌂●○◌◊﴾﴿',
#     "up": '▲',
#     "down": '▼',
#     "left": '◄',
#     "right": '►',
#     0: '.',
#     1: 'T',
#     2: 'R',
#     3: 'P',
#     4: '█',
#     5: '?',
#     20: 'T'
#     1: 'ᴼ',
#     2: 'ᶿ',
#     3: 'ᶲ',
#     4: 'ᶱ',
#     5: 'ᵟ',
#     6: 'ᵒ',
#     7: 'ᵡ',
#     8: 'ᵓ',
#     9: 'ᵔ',
#     10: 'ᵕ',
#     11: 'ᵖ',
#     12: 'ᵗ',
#     13: 'ᵘ',
#     14: 'ᵙ',
#     15: 'ᵚ',
#     16: 'ᵛ',
#     17: 'ᵜ',
#     18: 'ᵝ',
#     19: 'ᵞ',
#     20: 'ᵟ',
#     21: 'ᵠ',
    # 'tbu': f'֍֎۩۝۞ѺѺ҈҉⌂●○◌◊﴾﴿',
    # 'tbu10': '▁▂▃▄▅▆▇█▉▊▋▌▍▎▏',
    # 'tbu11': '▐░▒▓▔▕▖▗▘▙▚▛▜▝▞▟',
    # 'tbu12': '□▢▣▤▥▦▧▨▩▪▫▬▭▮▯',
    # 'tbu13': '▰▱▲△▴▵▶▷▸▹►▻▼▽▾▿',
    # 'tbu14': '◀◁◂◃◄◅◆◇◈◉◊○◌◍◎',
    # 'tbu15': '●◐◑◒◓◔◕◖◗◘◙◚◛◜◝◞◟',
    # 'tbu16': '◠◡◢◣◤◥◦◧◨◩◪◫◬◭◮◯',
    # 'tbu17': '◰◱◲◳◴◵◶◷◸◹◺◻◼◽◾◿',
    # 'tbu18': '─│┌┐└┘├┤┬┴┼═║╒╓╔╕╖╗╘╙╚╛╜╝╞╟╠╡╢╣╤╥╦╧╨╩╪╫╬',
    # 'tbu19': 'ꟀꝊₒ⁰ꟁꝋṍṏṑṓᶿᶲᶱᵟᵒᴼᵓᵔᵕᵖᵗᵘᵙᵚᵛᵜᵝᵞᵟᵠᵡᵢᵣᵤᵥᵦᵧᵨᵩᵪᵫᵬᵭᵮᵯᵰᵱᵲᵳᵴᵵᵶᵷᵸᵹᵺᵻᵼᵽᵾᵿ',
    # 'new': '       ■  ▀     ',
    # "up": '▲',
    # "down": '▼',
    # "left": '◄',
    # "right": '►',

